// --- Виды ВНД
// Виды ВНД - справочник
export interface DictionaryTypeVnd {
    id: string;
    name: string; // Наименование вида
}

// Виды ВНД - мокданные (обычные значения в справочнике)
export const TYPE_VND: DictionaryTypeVnd[] = [
    { id: "1",  name: "Базовые условия кредитного продукта" },
    { id: "2",  name: "Договор" },
    { id: "3",  name: "Должностная инструкция" },
    { id: "4",  name: "Инструкция" },
    { id: "5",  name: "Кодекс" },
    { id: "6",  name: "Концепция" },
    { id: "7",  name: "Лимиты" },
    { id: "8",  name: "Матрица" },
    { id: "9",  name: "Методика" },
    { id: "10", name: "План" },
    { id: "11", name: "Политика" },
    { id: "12", name: "Положение" },
    { id: "13", name: "Порядок" },
    { id: "14", name: "Правила" },
    { id: "15", name: "Программа" },
    { id: "16", name: "Процедура" },
    { id: "17", name: "Регламент" },
    { id: "18", name: "Руководство" },
    { id: "19", name: "Система" },
    { id: "20", name: "Устав" },
];

//////////////////////////////////////////////////////////////

// --- СП
// Структурные подразделения - справочник
export interface OrganizationUnit {
    id: string;
    name: string; // Наименование СП
    parentId?: string; // Родительское СП
}

// Структурные подразделения - мокданные (обычные значения в справочнике)
export const ORG_UNITS: OrganizationUnit[] = [
    { id: "1", name: "Управление делами" },
    { id: "2", name: "Начальник УД", parentId: "1" },

    { id: "3", name: "Управление информационных технологий" },
    { id: "4", name: "Управление казначейских операций" },

    { id: "5", name: "Управление комплаенс контроля" },
    { id: "6", name: "Отдел комплаенс контроля", parentId: "5" },
    { id: "7", name: "Отдел контроля качества", parentId: "5" },

    { id: "8", name: "Управление кредитования" },

    { id: "10", name: "Управление маркетинга" },
    { id: "11", name: "Управление обеспечения кредитов" },
    { id: "12", name: "Управление обеспечения кредитов (УОК)" },

    { id: "13", name: "Управление платежных сервисов" },
    { id: "14", name: "Отдел претензионной работы", parentId: "13" },
    { id: "15", name: "Отдел учета платежных систем", parentId: "13" },
    { id: "16", name: "Отдел эквайринга", parentId: "13" },
    { id: "17", name: "Отдел эмиссии", parentId: "13" },

    { id: "18", name: "Управление по взаимоотношениям с клиентами" },
    { id: "19", name: "Управление по работе с проблемными кредитами" },
    { id: "20", name: "Управление по работе с прочей собственностью" },
    { id: "21", name: "Управление поддержки бизнеса" },

    { id: "22", name: "Управление продаж" },
    { id: "23", name: "Отдел операционного сопровождения", parentId: "22" },
    { id: "24", name: "Отдел регионального сопровождения", parentId: "22" },

    { id: "25", name: "Управление продаж МСБ" },

    { id: "26", name: "Управление рисками" },
    { id: "27", name: "Сектор операционных рисков УР", parentId: "26" },

    { id: "28", name: "Управление риск-менеджмента" },
    { id: "29", name: "Управление розничных продаж" },
    { id: "30", name: "Управление розничных продуктов" },
    { id: "31", name: "Управление стратегического планирования и бюджетирования" },
    { id: "32", name: "Управление человеческими ресурсами" },
    { id: "33", name: "Управление методологии и продуктов" },
    { id: "34", name: "Юридическое управление" },

    { id: "35", name: "Административный отдел" },
    { id: "36", name: "Правление" },
    { id: "37", name: "Канцелярия" },
    { id: "38", name: "УБУиО" },
    { id: "39", name: "Департамент безопасности" },
];

//////////////////////////////////////////////////////////////

// --- Ключевые слова
// Ключевые слова - справочник
export interface Keyword {
    id: string;
    name: string;
    parentId?: string;
}

// Ключевые слова - мокданные (обычные значения в справочнике)
export const KEYWORDS: Keyword[] = [
    { id: "1", name: "Идентификация" },
    { id: "2", name: "Анализ" },

    { id: "3", name: "Сверка" },
    { id: "4", name: "Сверка остатков", parentId: "3" },
    { id: "5", name: "Сверка данных", parentId: "3" },

    { id: "6", name: "Ответственность" },
    { id: "7", name: "Бюджет" },

    { id: "8", name: "Расход" },
    { id: "9", name: "Расход материальный", parentId: "8" },
    { id: "10", name: "Расход операционный", parentId: "8" },

    { id: "11", name: "Безопасность" },
    { id: "12", name: "Матрица" },

    { id: "13", name: "План" },
    { id: "14", name: "План-график", parentId: "13" },
    { id: "15", name: "План мероприятий", parentId: "13" },

    { id: "16", name: "Формирование" },
    { id: "17", name: "Резервный сервер" },
    { id: "18", name: "Автоматизация" },
    { id: "19", name: "Непрерывность" },
];

//////////////////////////////////////////////////////////////

// --- Рубрикатор
// Рубрикатор - справочник
export interface Rubric {
    id: string;
    name: string;
    parentId?: string;
}

// Рубрикатор - мокданные (обычные значения в справочнике)
export const RUBRICS: Rubric[] = [
    { id: "1", name: "Структурные подразделения Головного офиса" },
    { id: "2", name: "Структурные подразделения филиалов" },

    { id: "3", name: "Безопасность" },
    { id: "4", name: "Информационные технологии" },
    { id: "5", name: "Управление рисками" },
    { id: "6", name: "Документооборот и делопроизводство" },
    { id: "7", name: "Управление персоналом" },

    { id: "8", name: "Кредитная деятельность" },
    { id: "9", name: "Розничное кредитование", parentId: "8" },
    { id: "10", name: "Корпоративное кредитование", parentId: "8" },

    { id: "11", name: "Депозиты и расчетно-кассовое обслуживание" },
    { id: "12", name: "Депозитные операции", parentId: "9" },
    { id: "13", name: "Расчетно-кассовое обслуживание", parentId: "9" },

    { id: "14", name: "Платежные карты и БСО" },
    { id: "15", name: "Бухгалтерский учет и отчетность" },
    { id: "16", name: "Маркетинг и PR" },
];

//////////////////////////////////////////////////////////////

// --- Органы утверждения
// Органы утверждения - справочник
export interface ApprovalBody {
    id: string;
    name: string;
    parentId?: string;
}

// Органы утверждения - мокданные (обычные значения в справочнике)
export const ORGANS_APPROVAL: ApprovalBody[] = [
    { id: "1", name: "Комитет по управлению активами и пассивами" },
    { id: "2", name: "Общее собрание акционеров" },

    { id: "3", name: "Правление" },
    { id: "3.1", name: "Заместитель Председателя Правления", parentId: "3" },
    { id: "3.2", name: "Председатель Правления", parentId: "3" },
    { id: "3.3", name: "Член Правления", parentId: "3" },

    { id: "4", name: "Совет директоров" },
    { id: "5", name: "Тарифный комитет" },
];

//////////////////////////////////////////////////////////////

// --- Уровни секретности
// Уровни секретности - справочник
export interface SecurityLevel {
    id: string;
    name: string;
}

// Уровни секретности - мокданные (обычные значения в справочнике)
export const SECURITY_LEVELS: SecurityLevel[] = [
    { id: "1", name: "Открытый доступ" },
    { id: "2", name: "Конфиденциально" },
    { id: "3", name: "Секретно" },
    { id: "4", name: "Совершенно секретно" },
];

//////////////////////////////////////////////////////////////

// --- Группы пользователей
// Группы пользователей - справочник
export interface UserGroup {
    id: string;
    name: string;
    description?: string;
    userIds: string[]; // ссылки на User.id
}

// Группы пользователей - мокданные (обычные значения в справочнике)
export const USER_GROUPS: UserGroup[] = [
    {
        id: "1",
        name: "Согласующие ВНД",
        description: "Сотрудники, согласующие внутренние нормативные документы",
        userIds: [],
    },
    {
        id: "2",
        name: "Редакторы ВНД",
        description: "Группа доступа для согласования ВНД на юридическую экспертизу",
        userIds: [],
    },
    {
        id: "3",
        name: "ИТ-администраторы",
        description: "Полный доступ ко всем документам, включая настройку системы",
        userIds: [],
    },
];